export default [
    {
        type : '课程商店事件',
        des: '浏览课程详情（改商品）',
        code: '1201'
    },
    {
        type : '课程商店事件',
        des: '浏览老师详情',
        code: '1202'
    },
    {
        type : '课程商店事件',
        des: '浏分享课程（商品）',
        code: '1203'
    },
    {
        type : '课程商店事件',
        des: '选课咨询',
        code: '1204'
    },
    {
        type : '购买事件',
        des: '报名课程（改商品）',
        code: '1301'
    },
    {
        type : '购买事件',
        des: '取消报名',
        code: '1302'
    },
    {
        type : '购买事件',
        des: '支付课程',
        code: '1303'
    },
    {
        type : '购买事件',
        des: '支付成功',
        code: '1304'
    },
    {
        type : '课程事件',
        des: '已报课程详情',
        code: '1401'
    },
    {
        type : '课程事件',
        des: '课程小节详情',
        code: '1402'
    },
    {
        type : '课程事件',
        des: '查看课件',
        code: '1403'
    },
    {
        type : '课程事件',
        des: '查看标记',
        code: '1404'
    },
    {
        type : '课程事件',
        des: '查看课堂测验',
        code: '1405'
    },
    {
        type : '课程事件',
        des: '查看课程资料',
        code: '1406'
    },
    {
        type : '课程事件',
        des: '查看课程报告',
        code: '1407'
    },
    {
        type : '课程事件',
        des: '进入评价',
        code: '1408'
    },
    {
        type : '课程事件',
        des: '进入直播',
        code: '1409'
    },
    {
        type : '课程事件',
        des: '离开直播',
        code: '1410'
    },
    {
        type : '课程事件',
        des: '进入回放',
        code: '1411'
    },
    {
        type : '课程事件',
        des: '离开回放',
        code: '1412'
    },

]